In [4]:
import pandas as pd

df = pd.read_csv('csv_files/video_games_sales.csv')

df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [6]:
df.shape

(16598, 11)

In [7]:
df.value_counts()

Rank   Name                                              Platform  Year    Genre         Publisher   NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1      Wii Sports                                        Wii       2006.0  Sports        Nintendo    41.49     29.02     3.77      8.46         82.74           1
2      Super Mario Bros.                                 NES       1985.0  Platform      Nintendo    29.08     3.58      6.81      0.77         40.24           1
3      Mario Kart Wii                                    Wii       2008.0  Racing        Nintendo    15.85     12.88     3.79      3.31         35.82           1
4      Wii Sports Resort                                 Wii       2009.0  Sports        Nintendo    15.75     11.01     3.28      2.96         33.00           1
5      Pokemon Red/Pokemon Blue                          GB        1996.0  Role-Playing  Nintendo    11.27     8.89      10.22     1.00         31.37           1
                                                                                                                                                               ..
16596  Woody Woodpecker in Crazy Castle 5                GBA       2002.0  Platform      Kemco       0.01      0.00      0.00      0.00         0.01            1
16597  Men in Black II: Alien Escape                     GC        2003.0  Shooter       Infogrames  0.01      0.00      0.00      0.00         0.01            1
16598  SCORE International Baja 1000: The Official Game  PS2       2008.0  Racing        Activision  0.00      0.00      0.00      0.00         0.01            1
16599  Know How 2                                        DS        2010.0  Puzzle        7G//AMES    0.00      0.01      0.00      0.00         0.01            1
16600  Spirits & Spells                                  GBA       2003.0  Platform      Wanadoo     0.01      0.00      0.00      0.00         0.01            1
Name: count, Length: 16291, dtype: int64

In [8]:
df.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [10]:
df.isna()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
16593,False,False,False,False,False,False,False,False,False,False,False
16594,False,False,False,False,False,False,False,False,False,False,False
16595,False,False,False,False,False,False,False,False,False,False,False
16596,False,False,False,False,False,False,False,False,False,False,False
16597,False,False,False,False,False,False,False,False,False,False,False

In [19]:
df.fillna(df['Year'].mean(), inplace=True)

In [20]:
df2 = df.set_index('Publisher')

df2.loc['Nintendo'].sort_values('Year')

,Rank,Name,Platform,Year,Genre,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Publisher,,,,,,,,,,
Nintendo,1863,Popeye,NES,1983.0,Platform,0.51,0.12,0.45,0.02,1.10
Nintendo,422,Baseball,NES,1983.0,Sports,0.73,0.10,2.35,0.02,3.20
Nintendo,1811,Donkey Kong,NES,1983.0,Platform,0.23,0.05,0.84,0.01,1.13
Nintendo,1841,Donkey Kong Jr.,NES,1983.0,Platform,0.33,0.07,0.70,0.01,1.11
Nintendo,765,Mahjong,NES,1983.0,Misc,0.01,0.00,2.13,0.00,2.14
...,...,...,...,...,...,...,...,...,...,...
Nintendo,14304,Metroid Prime: Federation Force,3DS,2016.0,Action,0.02,0.01,0.01,0.00,0.03
Nintendo,5290,Star Fox: Zero,WiiU,2016.0,Shooter,0.16,0.10,0.07,0.03,0.35
Nintendo,2450,Kirby: Planet Robobot,3DS,2016.0,Action,0.26,0.10,0.44,0.04,0.85
Nintendo,11012,Disney Art Academy,3DS,2016.0,Action,0.01,0.01,0.07,0.00,0.09
Nintendo,12956,Culdcept Revolt,3DS,2016.0,Strategy,0.00,0.00,0.05,0.00,0.05

In [26]:
df['Publisher'].isna().sum()

np.int64(0)

In [27]:
df.iloc[200]

Rank                          201
Name            Super Mario Bros.
Platform                       GB
Year                       1999.0
Genre                    Platform
Publisher                Nintendo
NA_Sales                      3.4
EU_Sales                      1.3
JP_Sales                     0.15
Other_Sales                  0.22
Global_Sales                 5.07
Name: 200, dtype: object

In [32]:
df.groupby('Genre').count()

,Rank,Name,Platform,Year,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Genre,,,,,,,,,,
Action,3316,3316,3316,3316,3316,3316,3316,3316,3316,3316
Adventure,1286,1286,1286,1286,1286,1286,1286,1286,1286,1286
Fighting,848,848,848,848,848,848,848,848,848,848
Misc,1739,1739,1739,1739,1739,1739,1739,1739,1739,1739
Platform,886,886,886,886,886,886,886,886,886,886
Puzzle,582,582,582,582,582,582,582,582,582,582
Racing,1249,1249,1249,1249,1249,1249,1249,1249,1249,1249
Role-Playing,1488,1488,1488,1488,1488,1488,1488,1488,1488,1488
Shooter,1310,1310,1310,1310,1310,1310,1310,1310,1310,1310
Simulation,867,867,867,867,867,867,867,867,867,867
Sports,2346,2346,2346,2346,2346,2346,2346,2346,2346,2346
Strategy,681,681,681,681,681,681,681,681,681,681